/*⑤ menu.cpp文件的内容如下：*/
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include "menu.h"
/*函数功能：显示欢迎界面
函数参数：无形参
函数返回值：无返回值
*/
void menu()                                                            /*1.欢迎界面*/
{
	printf("********欢迎使用联系人系统！********\n");
	system("pause");                                                   /*输入任意键进入主菜单*/
}
/*函数功能：显示主菜单界面
函数参数：无形参
函数返回值：用户选择的编号
*/
int menuBase()                                                         /*2.顶层菜单函数*/
{
	int choice;                                                        /*定义变量choice记录选项*/
	printf("________________________________________\n");
	printf("|********     功能选择菜单     ********|\n");
	printf("|******** 1.增加新联系人信息   ********|\n");
	printf("|******** 2.修改联系人信息     ********|\n");
	printf("|******** 3.删除联系人信息     ********|\n");
	printf("|******** 4.拨号               ********|\n");
    printf("|******** 5.分类查看联系人信息 ********|\n");
	printf("|******** 6.查找联系人信息     ********|\n");
	printf("|******** 7.保存联系人信息     ********|\n");
	printf("|******** 8.模糊查找           ********|\n");
	printf("|******** 0.退出               ********|\n");
	printf("|______________________________________|\n");
	printf("请输入你的选择: ");
	scanf("%d",&choice);
	return choice;
}
/*函数功能：显示结构体菜单界面
函数参数：无形参
函数返回值：用户选择的编号
*/
int menuStruct()                                                        /*3.结构体菜单函数*/
{
	int choice;                                                        /*定义变量choice记录选项*/
	printf("__________________________________\n");
	printf("|********  项目选择菜单  ********|\n");
	printf("|******** 1.姓名         ********|\n");
	printf("|******** 2.手机号码     ********|\n");
	printf("|******** 3.家庭电话号码 ********|\n");
    printf("|******** 4.办公电话     ********|\n");
	printf("|******** 5.电子邮件     ********|\n");
	printf("|******** 6.分组         ********|\n");
	printf("|******** 0.返回主菜单   ********|\n");
	printf("|________________________________|\n");
	printf("请输入需要修改的项目所对应的编号： ");
	scanf("%d",&choice);
	return choice;
}
/*函数功能：辅助输出函数显示信息
函数参数：无形参
函数返回值：无返回值
*/
void menuout()
{
	printf("编号\t姓名\t手机号码\t\t家庭电话号码\t\t办公电话\t\t电子邮件\t\t分组\n");
}